app/Http/Controllers/ProductController.php

select * from `categories`
---
    public function formularioProducto(){

        $categorias = Category::all();

select * from `products` where `products`.`id` = 95 limit 1
---
    public function buscarProducto(Request $request){

        $id = $request->input('id');

        $producto = Product::find($id);

select * from `products` where `products`.`id` = '95' limit 1
select * from `categories`
---
    public function buscarProductoEdicion(Request $request){

        $id = $request->input('id');
        $producto = Product::find($id);
        $categorias_producto = $producto->categorias;
        $categorias = Category::all();

select * from `products` where `products`.`id` = '95' limit 1
update `products` set `nombre` = 'AAAAAABCCCC', `products`.`updated_at` = '2025-05-24 16:44:54' where `id` = 95
---
    public function edicionProducto(Request $request){

        $producto = Product::find($request->input('id'));

        if(!empty($request->input('nombre'))){
            $producto->nombre = strtoupper($request->input('nombre'));
            $producto->save();

select * from `categories`
---
    public function formularioCambiarPrecios(){

        $categorias = Category::all();

select * from `categories` where `categories`.`id` = '3' limit 1
update `products` set `precio` = 10.48, `products`.`updated_at` = '2025-05-24 17:16:27' where `id` = 96
update `products` set `precio` = 14.4243, `products`.`updated_at` = '2025-05-24 17:17:49' where `id` = 91
---
    public function cambiarPrecio(Request $request){


        $valor = $request->input('categoria');
        [$id, $nombre] = explode('|', $valor);
        $categoria = Category::find($id);
        $productos = $categoria->productos;
        $porcentaje = $request->porcentaje;


        if($request->accion == "suba"){
            foreach($productos as $producto){
                $resultado = round($producto->precio * (1 + $porcentaje / 100), 2);;
                $producto->precio = $resultado;
                $producto->save();
            }
        }

        if($request->accion == "baja"){
            foreach($productos as $producto){
                $resultado = $producto->precio * (1 - $porcentaje / 100);
                $producto->precio = $resultado;
                $producto->save();

select * from `products` where `stock` <= 5 order by `stock` asc
---
    public function controlStock(){
        $productos = Product::with('categorias')
        ->where('stock', '<=', 5)
        ->orderBy('stock','asc')
        ->get();