app/Http/Controllers/SaleController.php

select * from `products` where `nombre` like '%vas%'
---
    public function buscar(Request $request){
        $query = $request->get('query');
        $productos = Product::where('nombre', 'like', '%' . $query . '%')->get();

insert into `sales` (`user_id`, `fecha`, `total`) values (1, '2025-05-23 00:00:00', 98.63)
insert into `sale_details` (`sales_id`, `product_id`, `cantidad`, `precio_unitario`) values (122, 2, 7, '14.09')
select * from `products` where `products`.`id` = 2 limit 1
update `products` set `stock` = 100, `products`.`updated_at` = '2025-05-23 21:51:28' where `id` = 2
---
    public function registrar(Request $request){
        $productos = $request->all();
        Log::info('Datos de la venta: ', $request->all());


        $venta = Sale::create([
            'user_id' => Auth::user()['id'],
            'fecha' => Carbon::today('America/Argentina/Buenos_Aires'),
            'total' => $request->total
        ]);

        foreach ($productos['productos'] as $producto) {
            Sale_detail::create([
                'sales_id' => $venta->id,
                'product_id' => $producto['id'],
                'cantidad' => $producto['cantidad'],
                'precio_unitario' => $producto['precio']
            ]);


            $product = Product::find($producto['id']);
            $product->stock -= $producto['cantidad'];
            $product->save();

select * from `categories`
---
    public function formularioVentas(){
        $categorias = Category::all();

select * from `products` where `products`.`id` in (2, 3, 7, 22, 39, 44, 50, 77, 81, 93)
select `categories`.*, `category_product`.`product_id` as `pivot_product_id`, `category_product`.`category_id` as `pivot_category_id` from `categories` inner join `category_product` on `categories`.`id` = `category_product`.`category_id` where `category_product`.`product_id` in (2, 3, 7, 22, 39, 44, 50, 77, 81, 93)
select `product_id`, SUM(cantidad) as total_vendido, SUM(cantidad * precio_unitario) as total_recaudado from `sale_details` group by `product_id` order by `total_vendido` desc limit 10
---
    public function productosVendidos(){

        $productos = Sale_detail::with(['product.categorias'])
        ->select(
            'product_id',
            DB::raw('SUM(cantidad) as total_vendido'),
            DB::raw('SUM(cantidad * precio_unitario) as total_recaudado')
        )
        ->groupBy('product_id')
        ->orderByDesc('total_vendido')
        ->take(10)
        ->get();

select * from `products` where `products`.`id` in (21, 23, 27, 31, 61, 76, 84, 88, 101)
select `categories`.*, `category_product`.`product_id` as `pivot_product_id`, `category_product`.`category_id` as `pivot_category_id` from `categories` inner join `category_product` on `categories`.`id` = `category_product`.`category_id` where `category_product`.`product_id` in (21, 23, 27, 31, 61, 76, 84, 88, 101)
---
    public function productosVendidosCategoria(Request $request){

        $desde = $request->fecha;
        $hasta = Carbon::now()->toDateString();;
        $categoriaId = $request->id;

        $productos = Sale_detail::with('product.categorias')
            ->whereHas('sale', function ($q) use ($desde, $hasta) {
                $q->whereBetween('fecha', [$desde, $hasta]);
            })
            ->whereHas('product.categorias', function ($q) use ($categoriaId) {
                $q->where('categories.id', $categoriaId);
            })
            ->select(
                'product_id',
                DB::raw('SUM(cantidad) as total_vendido'),
                DB::raw('SUM(cantidad * precio_unitario) as total_recaudado')
            )
            ->groupBy('product_id')
            ->orderByDesc('total_vendido')
            ->take(10)
            ->get();

select * from `sale_details` where `sale_details`.`sales_id` in (115, 116, 117, 118, 119, 120, 121, 122, 123, 124)
select * from `users` where `users`.`id` in (1)
---
    public function ventasDia(Request $request){

        $fecha = $request->input('fecha');

       $ventas = Sale::with(['sales_details'])
        ->withCount('sales_details')
        ->whereDate('fecha', $fecha)
        ->orderByDesc('id')
        ->get();


        $userIds = $ventas->pluck('user_id')->unique();
        $vendedores = User::find($userIds);

select * from `products` where `products`.`id` in (2)
select * from `sale_details` where `sale_details`.`sales_id` in (125)
select * from `sales` where `sales`.`id` is null limit 1
select `categories`.*, `category_product`.`product_id` as `pivot_product_id`, `category_product`.`category_id` as `pivot_category_id` from `categories` inner join `category_product` on `categories`.`id` = `category_product`.`category_id` where `category_product`.`product_id` in (2)
---
    public function detalleVenta(Request $request){

        $id = $request->input('id');
        $sale = Sale::with('sales_details.product.categorias')->findOrFail($id);