app/Http/Controllers/Sale_detailController.php

public function eliminarProductoVenta(Request $request)
{
    $id = $request->input('id');
    $detalle = Sale_detail::find($id);

    if ($detalle) {
        $detalle->delete();
    }

    $sale_id = $request->input('sale_id');
    $sale = Sale::find($sale_id);
---
select * from `sale_details` where `sale_details`.`id` = 175 limit 1
delete from `sale_details` where `id` = 175
select * from `sales` where `sales`.`id` = 97 limit 1