app/Http/Controllers/UserController.php

    public function formularioEmpleado(){

        $permisos = Permission::all();
---
select * from `permissions`

    public function verificarCorreo(Request $request){

        $correo = $request->correo;
        $user = User::where('email', $correo)->first();
---
select * from `users` where `email` = 'briangonzaz305@gmail.com' limit 1